posts/2015-05-14-prayer-for-an-isolated-people.org
#+date: <2015-05-14>
#+filetags: religion prayer
#+title: Prayer for an Isolated People

God of Grace and Wholeness,\\

All around us, we see pain and heartache,\\
the effects of fragmented and broken systems,\\
communities, and families.\\
When the pain of others becomes\\
too much for us to bear,\\
we respond by building up walls\\
that separate us from the world.

So here we stay,\\
safe and secure\\
behind our walls of division,\\
seeing only ourselves,\\
our own problems,\\
and our own hopes.

We boast of our love for humanity,\\
while at the same time,\\
fail to see the needs of our neighbor.

But God, You have called us to be your people,\\
and you have have given us a new commandment,\\
the commandment to love one another.\\
Loving others, though, is something that we cannot do\\
from a position of safety and security,\\
for to love is embrace vulnerability and risk,\\
all for the sake of the beloved.\\

So, guide our hands to reach out across our walls\\
and open our eyes to see beyond ourselves,\\
so that we might be used by you\\
for the healing of this world.\\
\\
In the name of Jesus Christ,\\
who called us to be in the world,\\
but not of it,\\
we pray.\\

/Amen/




#+begin_tagline
Tagged: religion prayer
#+end_tagline
