docs/posts/2015-05-14-prayer-for-an-isolated-people.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer for an Isolated People</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/rss.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer for an Isolated People</h1>
<p class="subtitle" role="doc-subtitle">May 14, 2015</p>
</header><p>
God of Grace and Wholeness,<br>
</p>

<p>
All around us, we see pain and heartache,<br>
the effects of fragmented and broken systems,<br>
communities, and families.<br>
When the pain of others becomes<br>
too much for us to bear,<br>
we respond by building up walls<br>
that separate us from the world.
</p>

<p>
So here we stay,<br>
safe and secure<br>
behind our walls of division,<br>
seeing only ourselves,<br>
our own problems,<br>
and our own hopes.
</p>

<p>
We boast of our love for humanity,<br>
while at the same time,<br>
fail to see the needs of our neighbor.
</p>

<p>
But God, You have called us to be your people,<br>
and you have have given us a new commandment,<br>
the commandment to love one another.<br>
Loving others, though, is something that we cannot do<br>
from a position of safety and security,<br>
for to love is embrace vulnerability and risk,<br>
all for the sake of the beloved.<br>
</p>

<p>
So, guide our hands to reach out across our walls<br>
and open our eyes to see beyond ourselves,<br>
so that we might be used by you<br>
for the healing of this world.<br>
<br>
In the name of Jesus Christ,<br>
who called us to be in the world,<br>
but not of it,<br>
we pray.<br>
</p>

<p>
<i>Amen</i>
</p>




<div class="tagline" id="orga92c71b">
<p>
Tagged: <a href="../tags/religion.html">Religion</a> <a href="../tags/prayer.html">Prayer</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
